Revit 2024 API
ContourSetting.GetItemIndex Method
 Get the index of a contour setting item of the current contour setting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int GetItemIndex(
	ContourSettingItem item
)
Visual Basic
Public Function GetItemIndex ( _
	item As ContourSettingItem _
) As Integer
Visual C++
public:
int GetItemIndex(
	ContourSettingItem^ item
)
Parameters
item
Type: Autodesk.Revit.DB.ContourSettingItem
 The contour setting item.
Return Value
 The index of the input contour setting item. -1 if the item is not found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ContourSetting Class
Autodesk.Revit.DB Namespace